openwch/ch32v003/Demo Application/Easy_PD_Sink/Easy_PD_Sink_pro/sdk/Peripheral/src/ch32v00x_adc.c
    itmask = ADC_IT >> 8;
    enablestatus = (ADCx->CTLR1 & (uint8_t)ADC_IT);

    if(((ADCx->STATR & itmask) != (uint32_t)RESET) && enablestatus)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      ADC_ClearITPendingBit
 *
 * @brief   Clears the ADCx's interrupt pending bits.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_IT - specifies the ADC interrupt pending bit to clear.
 *            ADC_IT_EOC - End of conversion interrupt mask.
 *            ADC_IT_AWD - Analog watchdog interrupt mask.
 *            ADC_IT_JEOC - End of injected conversion interrupt mask.
 *
 * @return  none
 */
void ADC_ClearITPendingBit(ADC_TypeDef *ADCx, uint16_t ADC_IT)
{
    uint8_t itmask = 0;

    itmask = (uint8_t)(ADC_IT >> 8);
    ADCx->STATR = ~(uint32_t)itmask;
}

/*********************************************************************
 * @fn      ADC_Calibration_Vol
 *
 * @brief   ADC calibration voltage.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_CALVOL - ADC calibration voltage.
 *            ADC_CALVOL_50PERCENT - 50% VDD.
 *            ADC_CALVOL_75PERCENT - 75% VDD.
 *
 * @return  none
 */
void ADC_Calibration_Vol(ADC_TypeDef *ADCx, uint32_t ADC_CALVOL)
{
    ADCx->CTLR1 &= ~(uint32_t)(3<<25);
    ADCx->CTLR1 |= ADC_CALVOL;
}

/*********************************************************************
 * @fn      ADC_ExternalTrig_DLY
 *
 * @brief   ADC external trigger sources delay channels and time.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          channel - ADC external trigger sources delay channels.
 *            ADC_ExternalTrigRegul_DLY - External trigger sources regular.
 *            ADC_ExternalTrigInjec_DLY - External trigger sources injected.
 *          DelayTim - ADC external trigger sources delay time
 *              This parameter must range from 0 to 0x1FF.
 *
 * @return  none
 */
void ADC_ExternalTrig_DLY(ADC_TypeDef *ADCx, uint32_t channel, uint16_t DelayTim)
{
    ADCx->DLYR &= ~(uint32_t)(0x2FF);
    ADCx->DLYR |= channel;
    ADCx->DLYR |= DelayTim;
}

